In [1]:
# Cargar las bibliotecas necesarias
import pandas as pd
import yfinance as yf

In [6]:

# Descargar los datos de Bitcoin y S&P 500
btc = yf.download("BTC-USD", start="2010-01-01")["Adj Close"]
syp500 = yf.download("^GSPC", start="2010-01-01")["Adj Close"]

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

<bound method NDFrame.head of            Date     Adj Close
0    2014-09-17    457.334015
1    2014-09-18    424.440002
2    2014-09-19    394.795990
3    2014-09-20    408.903992
4    2014-09-21    398.821014
...         ...           ...
3573 2024-06-29  60887.378906
3574 2024-06-30  62678.292969
3575 2024-07-01  62851.980469
3576 2024-07-02  62029.015625
3577 2024-07-03  60542.640625

[3578 rows x 2 columns]>

In [ ]:

# Crear dataframes con las fechas y los precios
btc = btc.reset_index()
syp500 = syp500.reset_index()

In [15]:
syp500.head()

        Date    Adj Close
0 2010-01-04  1132.989990
1 2010-01-05  1136.520020
2 2010-01-06  1137.140015
3 2010-01-07  1141.689941
4 2010-01-08  1144.979980

In [16]:
btc.head()

        Date   Adj Close
0 2014-09-17  457.334015
1 2014-09-18  424.440002
2 2014-09-19  394.795990
3 2014-09-20  408.903992
4 2014-09-21  398.821014

In [22]:

# Unir los dataframes en uno solo
data = pd.merge(btc, syp500, on="Date", how="inner")
#

In [23]:
data.head()

        Date  Adj Close_x  Adj Close_y
0 2014-09-17   457.334015  2001.569946
1 2014-09-18   424.440002  2011.359985
2 2014-09-19   394.795990  2010.400024
3 2014-09-22   402.152008  1994.290039
4 2014-09-23   435.790985  1982.770020

In [24]:

# Renombrar las columnas
data = data.rename(columns={"Date": "date", "Adj Close_x": "btc", "Adj Close_y": "syp500"})

In [25]:
data.head()

        date         btc       syp500
0 2014-09-17  457.334015  2001.569946
1 2014-09-18  424.440002  2011.359985
2 2014-09-19  394.795990  2010.400024
3 2014-09-22  402.152008  1994.290039
4 2014-09-23  435.790985  1982.770020